Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.DrawTextToView Method
 Draws a temporary text to the specified view. You can set the view Identifier.ID = 0 for current active view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int DrawTextToView(
	Point Location,
	string Text,
	Color Color,
	View View
)
Public Function DrawTextToView (
	Location As Point,
	Text As String,
	Color As Color,
	View As View
) As Integer
Parameters
Location
Type: Tekla.Structures.Geometry3d.Point
The location of the text's top-left corner.
Text
Type: System.String
The text to be drawn. The maximum length is 511 characters.
Color
Type: Tekla.Structures.Model.UI.Color
The color of the text. The transparency value of the color is ignored.
View
Type: Tekla.Structures.Model.UI.View
The model view (ID = 0 for current active view)
Return Value
Type: Int32
The id of the inserted text.
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace